api/app/models/user.rb

UPDATE "users" SET rank = rank + 1 WHERE (rank >= 2 AND rank < 4)
UPDATE "users" SET "rank" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["rank", 2], ["updated_at", "2024-07-20 08:35:18.364531"], ["id", 4]]
---
  def self.update_ranks(winner, loser)
    rank_down_users = where("rank >= ? AND rank < ?", loser.rank, winner.rank)
    rank_down_users.update_all("rank = rank + 1")