api/app/controllers/battles_controller.rb

  def unapproved_list
    self_user = User.find(params[:self_id])
    unapproved_list = self_user.defended_battles.where(defender_approval_status: :unapproved)
    json = unapproved_list.map do |battle|
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "battles".* FROM "battles" WHERE "battles"."defender_id" = $1 AND "battles"."defender_approval_status" = $2  [["defender_id", 2], ["defender_approval_status", 0]]

  def battle
    self_user = User.find(params[:self_id])
    opponent_user = User.find(params[:opponent_id])

    Battle.create(
      challenger_id: self_user.id,
      defender_id: opponent_user.id,
      challenger_result_status: params[:result_status],
      defender_approval_status: :unapproved # 列挙型(未承認)
    )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "battles" ("challenger_id", "defender_id", "challenger_result_status", "defender_approval_status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def approve
    battle = Battle.find(params[:battle_id])
    battle.approve

    User.update_rank_up(battle.challenger_id, battle.defender_id) if battle.challenger_result_status == 'win'
---
SELECT "battles".* FROM "battles" WHERE "battles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "rank" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["rank", 2], ["updated_at", "2024-07-20 08:35:18.364531"], ["id", 4]]
UPDATE "battles" SET "defender_approval_status" = $1, "updated_at" = $2 WHERE "battles"."id" = $3  [["defender_approval_status", 1], ["updated_at", "2024-07-07 10:44:59.307019"], ["id", 1]]

  def reject
    battle = Battle.find(params[:battle_id])
---
SELECT "battles".* FROM "battles" WHERE "battles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]