api/app/controllers/users_controller.rb

UPDATE "users" SET "rank" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["rank", 6], ["updated_at", "2024-06-02 03:54:22.860379"], ["id", 9]]
---
  def update
    user = User.find(params[:id])

    update_params = {
      name: params[:name],
      email: params[:email],
      display_id: params[:display_id],
      status: '1'
    }
    update_params[:password] = params[:password] if params[:password].present?

    if user.update(update_params)