api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."rank" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "rank", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "いいい"], ["email", "qqqq"], ["rank", 101], ["status", "1"], ["created_at", "2024-06-02 03:48:02.727031"], ["updated_at", "2024-06-02 03:48:02.727031"]]
---
  def create
    # userの一番下のランクを取得
    last_user_rank = User.order(rank: :desc).first.rank
    new_rank = last_user_rank + 1

    # FIXME: パスワードがない
    user = User.new(
      name: params[:name],
      email: params[:email],
      rank: new_rank,
      status: '1'
    )

    if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "rank" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "よしひこ"], ["rank", nil], ["updated_at", "2024-06-08 07:35:25.165622"], ["id", 2]]
---
  def update
    user = User.find(params[:id])
    if user.update(
      name: params[:name],
      email: params[:email],
      status: '1'
    )

SELECT "users".* FROM "users" ORDER BY "users"."rank" ASC
SELECT COUNT(*) FROM "battles" WHERE "battles"."defender_id" = $1 AND "battles"."defender_approval_status" = $2  [["defender_id", 1], ["defender_approval_status", 0]]
---
  def rank
    users = User.all.order(rank: :asc)

    json = users.map do |user|
      {
        id: user.id,
        rank: user.rank,
        name: user.name,
        is_unapproved: user.defended_battles.where(defender_approval_status: :unapproved).count > 0,
      }

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def vs_challenge
    user = User.find(params[:id])